# 변수

In [9]:
a = 'abc'
b = 'xyz'
c = 3
print(a+b)
print(a*c)

abcxyz
abcabcabc



---

# 튜플,딕셔너리,리스트
1. 튜플 (값1 ,값2, 값3)
 - 리스트의 상수형
2. 딕셔너리 {키값1 : 값1 ,키값2 : 값2}
3. 리스트 [값1 , 값2, 값3] 
 - 값의 접근은 인덱스(index)로 한다 (0번째부터)

## 튜플

In [36]:
tu = ('a','b','c',1,2,3)
print(tu)
print(tu[1])
print(tu[4])

('a', 'b', 'c', 1, 2, 3)
b
2



---

## 딕셔너리

In [15]:
di = {'id':'jisu', 'pw':1111}
print(di['id'], di['pw']) # select
di['키값'] = '들어갈값' # insert
print(di)

jisu 1111
{'id': 'jisu', 'pw': 1111, '키값': '들어갈값'}

In [17]:
di['키값'] = '변경할값' # update
di['id'] = '홍길동'
print(di)

{'id': '홍길동', 'pw': 1111, '키값': '변경할값'}


---

## 리스트
1. list.append('추가할 값')
2. list.insert(원하는 위치의 인덱스값,'추가할값')
3. list.remove('값')
4. list.pop( or index)
5. del list[index][...]

In [19]:
list_a = [1,2,3,'a','b','cdf']
list_a[0] = 'first' # 인덱스 0 번째의 값을 'first' 로 변경 (update)
list_a.append('마지막') # 리스트의 제일 뒤에 추가 (insert)
print(list_a)
list_a.insert(1,'second') #  (원하는 위치에 insert)
# 인덱스 :1의 위치에 'second'를 추가하고 나머지는 뒤로 밀림
print(list_a)

['first', 2, 3, 'a', 'b', 'cdf', '마지막']
['first', 'second', 2, 3, 'a', 'b', 'cdf', '마지막']

### 삭제
1. list.pop(  or index ) 
    - 괄호 안에 인덱스를 입력하지 않으면 자동으로 가장 마지막값이 빠져나오면서 삭제됨
    - 인덱스를 지정하면 그 값을 뺌
2. list.remove('값')
- list에 들어있는 '값'을 삭제함
3. del list[ index ]

In [22]:
list_a.pop() # 리스트의 마지막에 있는 값을 삭제
list_a.pop(1) # 인덱스 값을 넣으면 그자리의 값을 삭제
list_a.remove('first')
print(list_a)

[2, 3, 'a']

In [23]:
del list_a[0] 
print(list_a)

[3, 'a']

In [26]:
list_b = [1,2,3,4,5,6]
del list_b[0:2] # 슬라이싱을 해서도 삭제 가능
print(list_b)

[3, 4, 5, 6]

In [27]:
list_a = [1,2,3,4,{'id':'aaaa','pw':555,'name':'jjj'}]
# list_a에 있는 dict에 있는 'id'에 해당하는 값을 제거하고 싶을때1
del list_a[4]['id']
print(list_a)

[1, 2, 3, 4, {'pw': 555, 'name': 'jjj'}]

In [31]:
list_a = [1,'lee',3,4,{'id':'aaaa','pw':555,'name':'jjj'}]
# list_a에 있는 dict에 있는 'id'에 해당하는 값을 제거하고 싶을때2
for i,val in enumerate(list_a):
    if type(val) == dict:
        del list_a[i]['id']
print(list_a)

[1, 2, 3, 4, {'pw': 555, 'name': 'jjj'}]

### 리스트 합치기

1. list1.append(list2)
2. list2.expend(list2)

In [74]:
lang1 = ["C", "C++", "JAVA"]
lang2 = ["Python", "Go", "C#"]

# lang1.append(lang2)
# print(  lang1  )  #['C', 'C++', 'JAVA', ['Python', 'Go', 'C#']]

lang1.extend(lang2)
print(  lang1  )  #['C', 'C++', 'JAVA', 'Python', 'Go', 'C#']

['C', 'C++', 'JAVA', 'Python', 'Go', 'C#']



---

## 캐스팅(casting) & 슬라이싱(slicing)
1. casting : 형(type) 변환
2. slicing : [처음 인덱스 : 나중 인덱스 :방향(-1/1),간격]

### casting
: 각각의 타입으로 둘러싸주면 된다
- int : 정수 
- str: 문자
- float: 실수
- bool : True/False

In [41]:
print ( bool(3)& bool(0) ) # True 와 False를 하면 False 
print ( str(3) + str(5)) #'3'(글자) 와 '5'(글자) 를 더하면 '35'
print (3 + int('5')) # 숫자의 합은 8

False
35
8

### ★★slicing
str, list, tuple 등에서 사용가능

In [42]:
msg = "ABCDE"
print ( msg[0:2]  ) 
print ( msg[3: ]  )
print ( msg[-2: ]  )

AB
DE
DE

In [ ]:
string = "홀짝홀짝홀짝"
print(string[ : :2])

In [45]:
list_a=['홀' ,'짝' ,'홀','짝','홀','짝']
list_a[::2]

['홀', '홀', '홀']

In [47]:
tu =('홀' ,'짝' ,'홀','짝','홀','짝')
tu[1::2]

('짝', '짝', '짝')

In [51]:
# 단어를 거꾸로
string = "PYTHON"
print( string[ : : -1] )

NOHTYP

In [56]:
phone_number = "010-1111-2222"
# 1. 슬라이싱을 이용
print(phone_number[0:3] + phone_number[4:8] +  phone_number[-4:])
# 2. replace를 이용
# phone_number1 = phone_number.replace("-", " ")
# print(phone_number1)
# 3. split을 이용
list_phone = phone_number.split('-')
print(list_phone)
print(list_phone[0] + list_phone[1] + list_phone[2])

01011112222
['010', '1111', '2222']
01011112222



---

## split() & strip() & replace()

In [63]:
a = '    공백    '
b = '010-555-7897'
c = '010.555.7777'
d = '000 555 8888'

### strip() 
: 좌우 공백 제거
- lstrip(), rstrip() 도 가능

In [61]:
print('처음',a.strip(),'끝')
print('처음',a.lstrip(),'끝')
print('처음',a.rstrip(),'끝')

처음 공백 끝
처음 공백     끝
처음     공백 끝

### split()
: 괄호 안에 구분자를 입력하지 않으면 기본적으로 구분자는 <b>'공백' </b>
- 나눈 값을 리스트로 돌려줌

In [65]:
print(b.split('-'))
print(c.split('.'))
print(d.split())

['010', '555', '7897']
['010', '555', '7777']
['000', '555', '8888']

### replace('값','바꿀값')

In [73]:
print(b.replace('-',''))
print(c.replace('.','-'))
print(d.replace(' ','--'))
print(b.replace('','/'))

0105557897
010-555-7777
000--555--8888
/0/1/0/-/5/5/5/-/7/8/9/7/



---

# DataFrame
1. np.array [값1 값2 값3]
2. pd.Series 
  [값1
   값2
   값3]
3.pd.DataFrame()
 - DataFrame이 될수 있는 것
  : np.array, dict, list, list_dict

In [1]:
import pandas as pd
import numpy as np

* Warning(경고) 핑크박스 안나오게 할 경우 사용

In [2]:
import warnings
warnings.filterwarnings(action='ignore')

## np.array()

1. 리스트는 .shape이 없음(에러남)
2. <font color=red> array에서 .shape 하면 앞에 있는게 열 뒤에 행 (열,행)
3. <font color=red> shape() 형태로 쓰지 않고 shape으로 씀
4. 리스트를 담아서 array로 만들어 주어야함

In [86]:
# list_a.append(np.nan) # 그냥 np.nan을 보여주기 위해 한번 써봤음
print(list_a)
arr_a = np.array(list_a)
print(type(arr_a),arr_a.shape,'\n',arr_a )

['홀', '짝', '홀', '짝', '홀', '짝', nan, nan]
<class 'numpy.ndarray'> (8,)
 ['홀' '짝' '홀' '짝' '홀' '짝' 'nan' 'nan']

In [92]:
list_df = pd.DataFrame(list_a, columns=['홀짝'])
arr_df = pd.DataFrame(arr_a)
print(arr_df)
print(list_df)

     0
0    홀
1    짝
2    홀
3    짝
4    홀
5    짝
6  nan
7  nan
    홀짝
0    홀
1    짝
2    홀
3    짝
4    홀
5    짝
6  NaN
7  NaN

In [96]:
my_list = [ [1,2,3], [10,20,30] ]
li_df=pd.DataFrame(my_list)

print(len(my_list), len(my_list[0]))
print('---')
print(li_df.shape)

2 3
---
(2, 3)
    0   1   2
0   1   2   3
1  10  20  30

In [99]:
li_df

    0   1   2
0   1   2   3
1  10  20  30

In [97]:
myarr = np.array(my_list)
print(myarr.shape)  #(2, 3) : 행열에서는 2행 3열
print(myarr)

(2, 3)
[[ 1  2  3]
 [10 20 30]]

In [98]:
arr_df= pd.DataFrame(myarr)
arr_df

    0   1   2
0   1   2   3
1  10  20  30

- 리스트를 np.array로 만들어서 pd.dataframe화 한 값과
- 리스트를 pd.dataframe으로 만든 값은 같다



---

## pd.Series()

<pre>
    data=list or array,
    index=None,
    dtype: Dtype | None = None,
    name=None,

- array나 list로 만들수 있음

In [101]:
s = pd.Series(list_a)
print(s.shape)
print(s)

(8,)
0      홀
1      짝
2      홀
3      짝
4      홀
5      짝
6    NaN
7    NaN
dtype: object

In [102]:
my_list = [1,2,3,'A',np.nan] 
s = pd.Series(data = my_list, index = range(5) , name ='seq')
print(s) # dtype 에 object 는 객체라는 뜻

0      1
1      2
2      3
3      A
4    NaN
Name: seq, dtype: object

In [109]:
my_list = [1,2,3,'A',np.nan] 
myarr = np.array(my_list)
s = pd.Series(data = myarr, index = range(5) , name ='seq')
print(s)
print(s.shape) # (5,) : 5행 1열
print('row갯수가 len() :',len(s))

0      1
1      2
2      3
3      A
4    nan
Name: seq, dtype: object
(5,)
row갯수가 len() : 5

In [111]:
s_df = pd.DataFrame(s) # series에서 name이 자동으로 column 으로 감
print(s_df)

   seq
0    1
1    2
2    3
3    A
4  nan



---

## pd.DataFrame
- <pre>df.DataFrame(data = ,index=  , columns = )

- 이후에 지정할 수도 있음<pre>
df.index = [10,20,30,40]
df.columns = ['code']

<pre><b>- df.head() ,
- df.tail(), 
- df.info(), 
- df.shape, 
- df.describe()

- <pre>
  data=None,
  index: Axes | None = None,
  columns: Axes | None = None,
  dtype: Dtype | None = None,

### List() or np.array() 
- 가로로 생김

In [113]:
two_list = [my_list]
two_arr = np.array(two_list)
print(two_list)
print(two_arr)

[[1, 2, 3, 'A', nan]]
[['1' '2' '3' 'A' 'nan']]

In [121]:
list_df = pd.DataFrame(two_list, index=['ind'],columns=['a','b','c','d','e'])
arr_df = pd.DataFrame(two_arr)
list_df

     a  b  c  d   e
ind  1  2  3  A NaN

In [122]:
list_df.T

   ind
a    1
b    2
c    3
d    A
e  NaN

In [116]:
arr_df

   0  1  2  3    4
0  1  2  3  A  nan

In [124]:
list_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, ind to ind
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       1 non-null      int64
 1   b       1 non-null      int64
 2   c       1 non-null      int64
 3   d       1 non-null      object
 4   e       0 non-null      float64
dtypes: float64(1), int64(3), object(1)
memory usage: 156.0+ bytes



---

### pd.Series()
- 새로로 생김

In [125]:
s = pd.Series([1,2,3,4])
df = pd.DataFrame(['a','b','c','d'], columns = ['code'])
df['seq'] = s
df['sal'] = [100,200,300,400]
df[['id','pw']] = np.array([['kim',111]] * 4)
df['tel'] = '010'
df['tel'] = '000'

df

  code  seq  sal   id   pw  tel
0    a    1  100  kim  111  000
1    b    2  200  kim  111  000
2    c    3  300  kim  111  000
3    d    4  400  kim  111  000

### Dict + List
-  {'컬럼명1' : [1,2,3,4], '컬럼명2' : [5,6,7,8]}

In [126]:
df = pd.DataFrame({'컬럼명1' : [1,2,3,4], '컬럼명2' : [5,6,7,8]})
df

   컬럼명1  컬럼명2
0     1     5
1     2     6
2     3     7
3     4     8

In [127]:
df.shape

(4, 2)

In [128]:
df.describe()

           컬럼명1      컬럼명2
count  4.000000  4.000000
mean   2.500000  6.500000
std    1.290994  1.290994
min    1.000000  5.000000
25%    1.750000  5.750000
50%    2.500000  6.500000
75%    3.250000  7.250000
max    4.000000  8.000000



---

### List + List
- <pre>[  ['1행1열','1행2열'] ,
     ['2행1열','2행2열' ]  ]

In [129]:
listlist = [['kim',111],['kim',111]]
df = pd.DataFrame(listlist , columns = ['a','b'])
df

     a    b
0  kim  111
1  kim  111



---

### List + Dict
- <pre> [   {'컬럼1':'1행1열','컬럼2':'1행2열'},
       {'컬럼1':'2행1열','컬럼2':'2행2열'},
       {'컬럼1':'3행1열','컬럼2':'3행2열'}   ]

In [130]:
listdic = [{'uid':'kim', 'upw':111},
           {'uid':'kim', 'upw':111}]
df= pd.DataFrame(listdic)
df

   uid  upw
0  kim  111
1  kim  111

---

## <b>멀티 DataFrame

* 리스트에 데이터프레임 채로 append() 해서 pd.concat([list])로 만들수 있다

* ref : https://pandas.pydata.org/docs/user_guide/merging.html#

In [3]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

In [4]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [5]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [6]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [8]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

* 아래 두 문법은 동일 결과

In [9]:
df_list = []
df_list.append(df1)
df_list.append(df2)
df_list.append(df3)
df_list

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [10]:
df_list = [df1, df2, df3]
df_list

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

### <font color=red size=6><b> df = pd.concat( [df1, df2, df3] ) </b></font>    
* 상당히 중요하고 좋은 문법  
* 대용량 데이터일 경우 수초면 끝나는 효율적 속도 !!!

In [11]:
df = pd.concat(df_list)
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

----

## pd.merge()

<pre>
----- how -----
left  : LEFT  OUTER JOIN
right : RIGHT OUTER JOIN
outer : FULL  OUTER JOIN

inner : INNER JOIN

<b>pd.merge(
    left, right,
    how="inner",  
    
    on=None,
    left_on=None,
    right_on=None,
    
    left_index=False,
    right_index=False, </b>
    
    sort=True,
    suffixes=("_x", "_y"),
    copy=True,
    indicator=False,
    validate=None,
)

* 샘플로 emp, dept테이블 사용

In [2]:
import cx_Oracle
conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
empdf = pd.read_sql("select * from emp", conn,  parse_dates=['HIREDATE'] ) 
conn.close()
empdf.columns = empdf.columns.str.lower()
empdf

NameError: name 'pd' is not defined

In [24]:
sql = "select * from dept"
deptdf = pd.read_sql(sql, conn)
deptdf.columns = deptdf.columns.str.lower()
deptdf.head()

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

### inner join

<pre>
select e.empno, e.ename, d.deptno, d.dname from emp e, dept d
where e.deptno = d.deptno;

select e.empno, e.ename, d.deptno, d.dname 
from emp e INNER JOIN dept d on e.deptno = d.deptno;

In [26]:
df = pd.merge(empdf, deptdf, on="deptno", how="inner")
df[ ['empno', 'ename', 'deptno', 'dname']]

    empno   ename  deptno       dname
0    7369   SMITH      20    RESEARCH
1    7566   JONES      20    RESEARCH
2    7788   SCOTT      20    RESEARCH
3    7876   ADAMS      20    RESEARCH
4    7902    FORD      20    RESEARCH
5    7499   ALLEN      30       SALES
6    7521    WARD      30       SALES
7    7654  MARTIN      30       SALES
8    7698   BLAKE      30       SALES
9    7844  TURNER      30       SALES
10   7900   JAMES      30       SALES
11   7782     CCC      10  ACCOUNTING
12   7839    KING      10  ACCOUNTING
13   7934  MILLER      10  ACCOUNTING

### Outer join - dept기준

<pre>
* <b>dept 기준 : 부족한 쪽 컬럼에 (+)</b>
select e.empno, e.ename, d.deptno, d.dname 
from emp e, dept d
where e.deptno(+) = d.deptno;

* <b>dept 기준 : 왼쪽/오른쪽 누가 기준인지</b>
select e.empno, e.ename, d.deptno, d.dname 
from emp e RIGHT OUTER JOIN dept d on e.deptno = d.deptno;

In [27]:
df = pd.merge(empdf, deptdf, on="deptno" , how="right")
df[ ['empno', 'ename', 'deptno', 'dname']]

     empno   ename  deptno       dname
0   7782.0     CCC      10  ACCOUNTING
1   7839.0    KING      10  ACCOUNTING
2   7934.0  MILLER      10  ACCOUNTING
3   7369.0   SMITH      20    RESEARCH
4   7566.0   JONES      20    RESEARCH
5   7788.0   SCOTT      20    RESEARCH
6   7876.0   ADAMS      20    RESEARCH
7   7902.0    FORD      20    RESEARCH
8   7499.0   ALLEN      30       SALES
9   7521.0    WARD      30       SALES
10  7654.0  MARTIN      30       SALES
11  7698.0   BLAKE      30       SALES
12  7844.0  TURNER      30       SALES
13  7900.0   JAMES      30       SALES
14     NaN     NaN      40  OPERATIONS

### FULL OUTER JOIN

<pre>
* <b>오라클은 full outer join은 없다 --> 양쪽 (+)는 없다  </b>
select e.empno, e.ename, d.deptno, d.dname 
from emp e, dept d
where e.deptno(+) = d.deptno(+);

* <b>dept 기준 : 왼쪽/오른쪽 한번씩 기준</b>
select e.empno, e.ename, d.deptno, d.dname 
from emp e FULL OUTER JOIN dept d on e.deptno = d.deptno;

* 단일리스트를 가지고 있는 경우
* 66번 부서를 갖는 사원정보 추가

In [28]:
empdf.loc[14] =  [9999, 'TEMPUSER', 'CLERK', 7902,'1980-12-17', 2000, 100, 66]
empdf

,empno,ename,job,mgr,hiredate,sal,comm,deptno
0,7369,SMITH,CLERK,7902.0,1980-12-17 00:00:00,800,0.0,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20 00:00:00,1600,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22 00:00:00,1250,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02 00:00:00,2975,0.0,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28 00:00:00,1250,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01 00:00:00,2850,0.0,30
6,7782,CCC,MANAGER,7839.0,1981-06-09 00:00:00,2450,0.0,10
7,7788,SCOTT,ANALYST,7566.0,1987-07-13 00:00:00,3000,0.0,20
8,7839,KING,PRESIDENT,0.0,1981-11-17 00:00:00,5000,0.0,10
9,7844,TURNER,SALESMAN,7698.0,1981-09-08 00:00:00,1500,0.0,30
10,7876,ADAMS,CLERK,7788.0,1987-07-13 00:00:00,1100,0.0,20
11,7900,JAMES,CLERK,7698.0,1981-12-03 00:00:00,950,0.0,30
12,7902,FORD,ANALYST,7566.0,1981-12-03 00:00:00,3000,0.0,20
13,7934,MILLER,CLERK,7782.0,1982-01-23 00:00:00,1300,0.0,10
14,9999,TEMPUSER,CLERK,7902.0,1980-12-17,2000,100.0,66

* 단일리스트를 가지고 있는 경우
* DataFrame화 시킨 후 concat(.., axis=0)

In [29]:
emp_list =  [[9900, 'AA', 'CLERK', 7902,'1980-12-17', 2000, 100, 66]]
one_row_list_df = pd.DataFrame(emp_list,  columns=empdf.columns)
one_row_list_df

   empno ename    job   mgr    hiredate   sal  comm  deptno
0   9900    AA  CLERK  7902  1980-12-17  2000   100      66

In [30]:
empdf = pd.concat([empdf, one_row_list_df], axis=0, ignore_index=True)
empdf

,empno,ename,job,mgr,hiredate,sal,comm,deptno
0,7369,SMITH,CLERK,7902.0,1980-12-17 00:00:00,800,0.0,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20 00:00:00,1600,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22 00:00:00,1250,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02 00:00:00,2975,0.0,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28 00:00:00,1250,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01 00:00:00,2850,0.0,30
6,7782,CCC,MANAGER,7839.0,1981-06-09 00:00:00,2450,0.0,10
7,7788,SCOTT,ANALYST,7566.0,1987-07-13 00:00:00,3000,0.0,20
8,7839,KING,PRESIDENT,0.0,1981-11-17 00:00:00,5000,0.0,10
9,7844,TURNER,SALESMAN,7698.0,1981-09-08 00:00:00,1500,0.0,30
10,7876,ADAMS,CLERK,7788.0,1987-07-13 00:00:00,1100,0.0,20
11,7900,JAMES,CLERK,7698.0,1981-12-03 00:00:00,950,0.0,30
12,7902,FORD,ANALYST,7566.0,1981-12-03 00:00:00,3000,0.0,20
13,7934,MILLER,CLERK,7782.0,1982-01-23 00:00:00,1300,0.0,10
14,9999,TEMPUSER,CLERK,7902.0,1980-12-17,2000,100.0,66
15,9900,AA,CLERK,7902.0,1980-12-17,2000,100.0,66

* 멀티 리스트 : 여러건을 추가
* DataFrame화 시킨 후 concat(.., axis=0)

In [31]:
empdf.columns

Index(['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno'], dtype='object')

In [32]:
emp_list = [[8800, 'TEMPUSER1', 'CLERK', 7902,'1980-12-17', 2000, 100, 66],
           [8801, 'TEMPUSER2', 'CLERK', 7902,'1980-12-17', 2000, 100, 66]]

mul_row_list_df = pd.DataFrame(emp_list, columns=empdf.columns) #컬럼이름 가져와서 지정
mul_row_list_df

   empno      ename    job   mgr    hiredate   sal  comm  deptno
0   8800  TEMPUSER1  CLERK  7902  1980-12-17  2000   100      66
1   8801  TEMPUSER2  CLERK  7902  1980-12-17  2000   100      66

In [33]:
empdf = pd.concat([empdf, mul_row_list_df], axis=0, ignore_index=True)
empdf

,empno,ename,job,mgr,hiredate,sal,comm,deptno
0,7369,SMITH,CLERK,7902.0,1980-12-17 00:00:00,800,0.0,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20 00:00:00,1600,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22 00:00:00,1250,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02 00:00:00,2975,0.0,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28 00:00:00,1250,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01 00:00:00,2850,0.0,30
6,7782,CCC,MANAGER,7839.0,1981-06-09 00:00:00,2450,0.0,10
7,7788,SCOTT,ANALYST,7566.0,1987-07-13 00:00:00,3000,0.0,20
8,7839,KING,PRESIDENT,0.0,1981-11-17 00:00:00,5000,0.0,10
9,7844,TURNER,SALESMAN,7698.0,1981-09-08 00:00:00,1500,0.0,30
10,7876,ADAMS,CLERK,7788.0,1987-07-13 00:00:00,1100,0.0,20
11,7900,JAMES,CLERK,7698.0,1981-12-03 00:00:00,950,0.0,30
12,7902,FORD,ANALYST,7566.0,1981-12-03 00:00:00,3000,0.0,20
13,7934,MILLER,CLERK,7782.0,1982-01-23 00:00:00,1300,0.0,10
14,9999,TEMPUSER,CLERK,7902.0,1980-12-17,2000,100.0,66
15,9900,AA,CLERK,7902.0,1980-12-17,2000,100.0,66
16,8800,TEMPUSER1,CLERK,7902.0,1980-12-17,2000,100.0,66
17,8801,TEMPUSER2,CLERK,7902.0,1980-12-17,2000,100.0,66

* Series로 가지고 있는 경우

In [46]:
s = pd.Series([7700, 'SSS', 'CLERK', 7902,'1980-12-17', 2000, 100, 66],
             index = empdf.columns)

dd = empdf.append(s.T, ignore_index=True)
dd

,empno,ename,job,mgr,hiredate,sal,comm,deptno
0,7369,SMITH,CLERK,7902.0,1980-12-17 00:00:00,800,0.0,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20 00:00:00,1600,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22 00:00:00,1250,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02 00:00:00,2975,0.0,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28 00:00:00,1250,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01 00:00:00,2850,0.0,30
6,7782,CCC,MANAGER,7839.0,1981-06-09 00:00:00,2450,0.0,10
7,7788,SCOTT,ANALYST,7566.0,1987-07-13 00:00:00,3000,0.0,20
8,7839,KING,PRESIDENT,0.0,1981-11-17 00:00:00,5000,0.0,10
9,7844,TURNER,SALESMAN,7698.0,1981-09-08 00:00:00,1500,0.0,30
10,7876,ADAMS,CLERK,7788.0,1987-07-13 00:00:00,1100,0.0,20
11,7900,JAMES,CLERK,7698.0,1981-12-03 00:00:00,950,0.0,30
12,7902,FORD,ANALYST,7566.0,1981-12-03 00:00:00,3000,0.0,20
13,7934,MILLER,CLERK,7782.0,1982-01-23 00:00:00,1300,0.0,10
14,9999,TEMPUSER,CLERK,7902.0,1980-12-17,2000,100.0,66
15,9900,AA,CLERK,7902.0,1980-12-17,2000,100.0,66
16,8800,TEMPUSER1,CLERK,7902.0,1980-12-17,2000,100.0,66
17,8801,TEMPUSER2,CLERK,7902.0,1980-12-17,2000,100.0,66
18,7700,SSS,CLERK,7902.0,1980-12-17,2000,100.0,66

* 66번 부서 사원 정보를 몇 건 추가 후 FULL OUTER JOIN

In [40]:
fdf = pd.merge(empdf, deptdf , on='deptno', how='outer')
fdf[ ['empno', 'ename', 'deptno', 'dname']].sort_values('deptno')

     empno      ename  deptno       dname
13  7934.0     MILLER      10  ACCOUNTING
12  7839.0       KING      10  ACCOUNTING
11  7782.0        CCC      10  ACCOUNTING
0   7369.0      SMITH      20    RESEARCH
1   7566.0      JONES      20    RESEARCH
2   7788.0      SCOTT      20    RESEARCH
3   7876.0      ADAMS      20    RESEARCH
4   7902.0       FORD      20    RESEARCH
10  7900.0      JAMES      30       SALES
9   7844.0     TURNER      30       SALES
8   7698.0      BLAKE      30       SALES
7   7654.0     MARTIN      30       SALES
6   7521.0       WARD      30       SALES
5   7499.0      ALLEN      30       SALES
18     NaN        NaN      40  OPERATIONS
14  9999.0   TEMPUSER      66         NaN
15  9900.0         AA      66         NaN
16  8800.0  TEMPUSER1      66         NaN
17  8801.0  TEMPUSER2      66         NaN

## JOIN

* pd.merge와 같은 기능인데 join은 행 인덱스 값을 기준으로 한다.
* 그냥 pd.merge사용

In [55]:
# df1.join(df2)